#  Нагаувач не залежить від віку
# Він допомогає не забути про подію
# Часто, ми забуваємо про важливі події, але нагадувач допоможе не забуди про заплановану подію

import time
# Імпортуємо модуль time для роботи з часом

print("Нагадувач")
#  Привітання

event = input("Що потрібно нагадати? ")
# Запитуємо у користувача подію для нагадування

while True:
    # Запускаємо цикл для запиту хвилин
    try:
        minutes = input("Через скільки хвилин нагадати? ")
        # Запитуємо кількість хвилин
        minutes = int(minutes)
        # Перетворюємо введене значення на ціле число
        if minutes > 0:
            # Перевіряємо, чи число хвилин є додатнє
            break
            # Виходимо з циклу, якщо число додатнє
        else:
            print("Помилка! Введіть додатнє число хвилин.")
            # Повідомляємо про помилку, якщо число не додатнє
    except ValueError:
        # Обробляємо помилку, якщо введене значення не є числом
        print("Помилка! Введіть ціле число для хвилин.")
        # Повідомляємо про помилку

print(f"Очікуємо {minutes} хвилин...")
# Повідомляємо про початок очікування
time.sleep(minutes * 60)
# Затримуємо виконання програми на вказану кількість хвилин (помножену на 60 для отримання секунд)
print(f"НАГАДУВАННЯ: {event}")
# Виводимо нагадування про подію