task= input("Привіт! Давайте зіграємо в гру. Відповідайте на запитання правильно!")
# Перше запитання
answer1 = input("Яка столиця України? \n")
if answer1 == "Київ":
    print("Правильно!!!")
else:
    print("Неправильно! Правильна відповідь: Київ")
# Друге запитання
answer2 = input("Скільки кольорів у веселці? \n")
if answer2 == "7":
    print("Правильно!!!")
else:
    print("Неправильно! Правильна відповідь: 7")
# Третє запитання
answer3 = input("Який найбільший океан на Землі? \n")
if answer3 == "Тихий":
    print("Правильно!!!")
else:
    print("Неправильно! Правильна відповідь: Тихий")
# Четверте запитання
answer4 = input("Яка планета найближча до Сонця? \n")
if answer4 == "Меркурій":
    print("Правильно!!!")
else:
    print("Неправильно! Правильна відповідь: Меркурій")
# П'яте запитання
answer5 = input("Який газ найбільше поширений в атмосфері Землі? \n")
if answer5 == "Азот":
    print("Правильно!!!")
else:
    print("Неправильно! Правильна відповідь: Азот")
# Шосте запитання
answer6 = input("Хто написав 'Кобзар'? \n")
if answer6 == "Тарас Шевченко":
    print("Правильно!!!")
else:
    print("Неправильно! Правильна відповідь: Тарас Шевченко")
print("Дякую за гру! Сподіваюся, вам сподобалося!")